; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-3-19)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-3 - location
	p1-2 - location
	p2-0 - location
	p3-2 - location
	p4-1 - location
	p4-2 - location
	p4-3 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s4)
	(at package2 s2)
	(at package3 s3)
	(at package4 s1)
	(at package5 s0)
	(at package6 s1)
	(at package7 s3)
	(at package8 s1)
	(at package9 s0)
	(at package10 s0)
	(at package11 s2)
	(at package12 s4)
	(at package13 s1)
	(at package14 s3)
	(at package15 s2)
	(at package16 s2)
	(at package17 s1)
	(at package18 s1)
	(at package19 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s4)
	(link s4 s2)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s1)
	(at driver4 s4)
	(at driver5 s0)
	(at truck1 s1)
	(at truck3 s3)
	(at package1 s1)
	(at package2 s3)
	(at package3 s0)
	(at package4 s3)
	(at package5 s0)
	(at package6 s0)
	(at package7 s3)
	(at package8 s3)
	(at package9 s4)
	(at package11 s4)
	(at package12 s1)
	(at package14 s2)
	(at package15 s3)
	(at package16 s0)
	(at package17 s3)
	(at package18 s4)
	(at package19 s0)
	))


)

; plan
1. (board-truck driver1 s1 truck2)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 23
2. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 2 of 23
3. (load-truck s2 package2 truck2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 2 of 23
4. (load-truck s2 package19 truck2)
   deleted: (at package19 s2)
   added: (in package19 truck2)
   goals met: 2 of 23
5. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 2 of 23
6. (load-truck s0 package9 truck2)
   deleted: (at package9 s0)
   added: (in package9 truck2)
   goals met: 2 of 23
7. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 2 of 23
8. (load-truck s2 package16 truck2)
   deleted: (at package16 s2)
   added: (in package16 truck2)
   goals met: 2 of 23
9. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 2 of 23
10. (unload-truck s0 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s0)
   goals met: 3 of 23
11. (unload-truck s0 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s0)
   goals met: 4 of 23
12. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 4 of 23
13. (load-truck s1 package8 truck2)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 4 of 23
14. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 4 of 23
15. (board-truck driver4 s0 truck1)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 4 of 23
16. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 4 of 23
17. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 4 of 23
18. (drive-truck driver1 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 4 of 23
19. (drive-truck driver1 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 4 of 23
20. (unload-truck s3 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s3)
   goals met: 5 of 23
21. (load-truck s3 package3 truck2)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   goals met: 5 of 23
22. (unload-truck s3 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   goals met: 6 of 23
23. (drive-truck driver1 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 6 of 23
24. (unload-truck s4 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s4)
   goals met: 7 of 23
25. (drive-truck driver1 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 7 of 23
26. (load-truck s2 package15 truck2)
   deleted: (at package15 s2)
   added: (in package15 truck2)
   goals met: 7 of 23
27. (drive-truck driver1 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 7 of 23
28. (load-truck s1 package6 truck2)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 7 of 23
29. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 7 of 23
30. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 7 of 23
31. (unload-truck s3 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   goals met: 8 of 23
32. (load-truck s3 package14 truck2)
   deleted: (at package14 s3)
   added: (in package14 truck2)
   goals met: 8 of 23
33. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 8 of 23
34. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 8 of 23
35. (unload-truck s2 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s2)
   goals met: 9 of 23
36. (load-truck s2 package11 truck2)
   deleted: (at package11 s2)
   added: (in package11 truck2)
   goals met: 9 of 23
37. (drive-truck driver1 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 9 of 23
38. (load-truck s4 package12 truck2)
   deleted: (at package12 s4)
   added: (in package12 truck2)
   goals met: 9 of 23
39. (drive-truck driver1 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 9 of 23
40. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 9 of 23
41. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 9 of 23
42. (load-truck s1 package4 truck2)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 9 of 23
43. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 9 of 23
44. (unload-truck s0 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 10 of 23
45. (unload-truck s0 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 11 of 23
46. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 11 of 23
47. (load-truck s1 package18 truck2)
   deleted: (at package18 s1)
   added: (in package18 truck2)
   goals met: 11 of 23
48. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 11 of 23
49. (drive-truck driver1 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 11 of 23
50. (unload-truck s4 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s4)
   goals met: 12 of 23
51. (unload-truck s4 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s4)
   goals met: 13 of 23
52. (load-truck s4 package1 truck2)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   goals met: 13 of 23
53. (drive-truck driver1 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 13 of 23
54. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 13 of 23
55. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 13 of 23
56. (load-truck s1 package17 truck2)
   deleted: (at package17 s1)
   added: (in package17 truck2)
   goals met: 13 of 23
57. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 13 of 23
58. (drive-truck driver4 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 14 of 23
59. (walk driver2 s3 p4-3)
   deleted: (at driver2 s3)
   added: (at driver2 p4-3)
   goals met: 14 of 23
60. (walk driver2 p4-3 s4)
   deleted: (at driver2 p4-3)
   added: (at driver2 s4)
   goals met: 14 of 23
61. (walk driver5 s3 p0-3)
   deleted: (at driver5 s3)
   added: (at driver5 p0-3)
   goals met: 14 of 23
62. (walk driver5 p0-3 s0)
   deleted: (at driver5 p0-3)
   added: (at driver5 s0)
   goals met: 15 of 23
63. (board-truck driver2 s4 truck3)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 15 of 23
64. (drive-truck driver2 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 16 of 23
65. (drive-truck driver2 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 15 of 23
66. (drive-truck driver2 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 15 of 23
67. (disembark-truck driver2 s1 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 16 of 23
68. (board-truck driver3 s1 truck3)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 16 of 23
69. (drive-truck driver3 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 16 of 23
70. (drive-truck driver3 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 17 of 23
71. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 17 of 23
72. (unload-truck s1 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s1)
   goals met: 18 of 23
73. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 18 of 23
74. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 18 of 23
75. (unload-truck s3 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   goals met: 19 of 23
76. (unload-truck s3 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s3)
   goals met: 20 of 23
77. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 20 of 23
78. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 20 of 23
79. (unload-truck s1 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 21 of 23
80. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 21 of 23
81. (disembark-truck driver1 s0 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 22 of 23
82. (disembark-truck driver4 s1 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 22 of 23
83. (walk driver4 s1 p4-1)
   deleted: (at driver4 s1)
   added: (at driver4 p4-1)
   goals met: 22 of 23
84. (walk driver4 p4-1 s4)
   deleted: (at driver4 p4-1)
   added: (at driver4 s4)
   goals met: 23 of 23
